План_полетов_файловый_edt/src/Documents/ФормаС/ФормаС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ФормаС</name>
  <registerRecords>InformationRegister.СоздателиФормаС</registerRecords>
  <registerRecords>InformationRegister.СвязьФормаСПрилетВылет</registerRecords>
  <registerRecords>AccumulationRegister.ДанныеФормС</registerRecords>
  <registerRecords>InformationRegister.ОтветственныеФормаС</registerRecords>
  <attributes>
    <name>РейсПрибытия</name>
    <type>
      <types>CatalogRef.Рейсы</types>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецВС</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Плательщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипВС</name>
    <type>
      <types>CatalogRef.ТипыВоздушныхСудов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИВремяПосадки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИВремяВылета</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособОплаты</name>
    <type>
      <types>EnumRef.СпособыОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>КурсВалюты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Масса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Итого</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РучноеРедактирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИтогоНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Прилет</name>
    <type>
      <types>DocumentRef.Прилеты</types>
    </type>
  </attributes>
  <attributes>
    <name>Вылет</name>
    <type>
      <types>DocumentRef.Вылеты</types>
    </type>
  </attributes>
  <attributes>
    <name>Представитель</name>
    <type>
      <types>CatalogRef.ПредставителиАвиакомпаний</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерБорта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РейсОтправления</name>
    <type>
      <types>CatalogRef.Рейсы</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Услуга</name>
      <type>
        <types>CatalogRef.Услуги</types>
      </type>
    </attributes>
    <attributes>
      <name>ПревышениеРегламента</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>11</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Основание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>8</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <comment>Истина - У.Е., Ложь - Рубль</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

План_полетов_файловый_edt/src/InformationRegisters/Цены/Цены.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Цены</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Основание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДействителенДо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <comment>Истина - У.Е., Ложь - Рубль</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Услуга</name>
    <type>
      <types>CatalogRef.Услуги</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИностранныйВС</name>
    <comment>Ложь - российский владелец ВС, истина - иностранный</comment>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МассаЛ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>МассаП</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипВС</name>
    <type>
      <types>CatalogRef.ТипыВоздушныхСудов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЭтоВертолет</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

План_полетов_файловый_edt/src/InformationRegisters/Скидки/Скидки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Скидки</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Процент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Основание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДействителенДо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Услуга</name>
    <type>
      <types>CatalogRef.Услуги</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИностранныйВС</name>
    <comment>Ложь - российский владелец ВС, истина - иностранный</comment>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Авиакомпания</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РейсОтправления</name>
    <type>
      <types>CatalogRef.Рейсы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

План_полетов_файловый_edt/src/InformationRegisters/СтавкаНДС/СтавкаНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтавкаНДС</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Процент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
</mdclass:InformationRegister>

План_полетов_файловый_edt/src/InformationRegisters/УслугиВедомственных/УслугиВедомственных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УслугиВедомственных</name>
  <dimensions>
    <name>Услуга</name>
    <type>
      <types>CatalogRef.Услуги</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

План_полетов_файловый_edt/src/Enums/ВидыПолета/ВидыПолета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыПолета</name>
  <enumValues>
    <name>Российский</name>
  </enumValues>
  <enumValues>
    <name>Иностранный</name>
  </enumValues>
  <enumValues>
    <name>Ведомственный</name>
  </enumValues>
</mdclass:Enum>

План_полетов_файловый_edt/src/Documents/Прилеты/Прилеты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Прилеты</name>
  <registerRecords>AccumulationRegister.ДанныеПрилетов</registerRecords>
  <attributes>
    <name>ВылетИзКпПлан</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВылетИзКпФакт</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрибытиеПлан</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрибытиеФакт</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрибытиеРасчет</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаЗадержки</name>
    <type>
      <types>CatalogRef.ПричиныЗадержекПрилетаВылетаВС</types>
    </type>
  </attributes>
  <attributes>
    <name>ПассажирыВзрослые</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПассажирыДети</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПассажирыМалыши</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РучнаяКладь</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Багаж</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Почта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Груз</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗапаснойАП</name>
    <type>
      <types>CatalogRef.Аэропорты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрибытиеНаЗапаснойАП</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Регулярность</name>
    <type>
      <types>CatalogRef.ВидыПолета</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Рейс</name>
    <type>
      <types>CatalogRef.Рейсы</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерБорта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипВС</name>
    <type>
      <types>CatalogRef.ТипыВоздушныхСудов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаНеприбытия</name>
    <type>
      <types>CatalogRef.ПричиныНеприбытия</types>
    </type>
  </attributes>
  <attributes>
    <name>Неприбыл</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КВС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АэропортВылета</name>
    <type>
      <types>CatalogRef.Аэропорты</types>
    </type>
  </attributes>
  <attributes>
    <name>АэропортПрилета</name>
    <type>
      <types>CatalogRef.Аэропорты</types>
    </type>
  </attributes>
  <attributes>
    <name>УходНаЗапаснойАП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗадержкаПрилета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВключатьВСуточныйПлан</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Document>

План_полетов_файловый_edt/src/Catalogs/Рейсы/Рейсы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Рейсы</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ВидПолета</name>
    <type>
      <types>CatalogRef.ВидыПолета</types>
    </type>
  </attributes>
  <attributes>
    <name>АэропортВылета</name>
    <type>
      <types>CatalogRef.Аэропорты</types>
    </type>
  </attributes>
  <attributes>
    <name>АэропортПрилета</name>
    <type>
      <types>CatalogRef.Аэропорты</types>
    </type>
  </attributes>
  <attributes>
    <name>Авиакомпания</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеДляИнформТабло</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

План_полетов_файловый_edt/src/Documents/ФормаС/Forms/ФормаДокумента/Module.bsl
&НаСервере
Функция ПолучитьЦену(Услуга,ВладелецВС,Авиакомпания,Дата,Масса,ТипВС,Рейс)
	//получаем базовую цену на услугу
	Выборка = Новый Структура;
	Запрос1 = Новый Запрос;
	Запрос1.Текст =
	"ВЫБРАТЬ
	|	ЦеныСрезПоследних.Цена КАК Цена,
	|	ЦеныСрезПоследних.Основание КАК Основание,
	|	ЦеныСрезПоследних.Валюта КАК Валюта
	|ИЗ
	|	РегистрСведений.Цены.СрезПоследних(
	|			&Дата,
	|			ЭтоВертолет = &ЭтоВертолет
	|				И &ЭтоВертолет = ИСТИНА
	|				И ДействителенДо >= &Дата
	|				И ИностранныйВС = &ИностранныйВС
	|				И &ИностранныйВС = ИСТИНА
	|				И Услуга = &Услуга
	|				И МассаЛ <= &Масса
	|				И МассаП >= &Масса) КАК ЦеныСрезПоследних
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЦеныСрезПоследних.Цена,
	|	ЦеныСрезПоследних.Основание,
	|	ЦеныСрезПоследних.Валюта
	|ИЗ
	|	РегистрСведений.Цены.СрезПоследних(
	|			&Дата,
	|			ЭтоВертолет = &ЭтоВертолет
	|				И &ЭтоВертолет = ИСТИНА
	|				И ДействителенДо >= &Дата
	|				И Услуга = &Услуга
	|				И МассаЛ <= &Масса
	|				И МассаП >= &Масса) КАК ЦеныСрезПоследних
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЦеныСрезПоследних.Цена,
	|	ЦеныСрезПоследних.Основание,
	|	ЦеныСрезПоследних.Валюта
	|ИЗ
	|	РегистрСведений.Цены.СрезПоследних(
	|			&Дата,
	|			ЭтоВертолет = &ЭтоВертолет
	|				И &ЭтоВертолет = ИСТИНА
	|				И ДействителенДо >= &Дата
	|				И ИностранныйВС = &ИностранныйВС
	|				И &ИностранныйВС = ИСТИНА
	|				И Услуга = &Услуга) КАК ЦеныСрезПоследних
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЦеныСрезПоследних.Цена,
	|	ЦеныСрезПоследних.Основание,
	|	ЦеныСрезПоследних.Валюта
	|ИЗ
	|	РегистрСведений.Цены.СрезПоследних(
	|			&Дата,
	|			ЭтоВертолет = &ЭтоВертолет
	|				И &ЭтоВертолет = ИСТИНА
	|				И ДействителенДо >= &Дата
	|				И Услуга = &Услуга) КАК ЦеныСрезПоследних
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЦеныСрезПоследних.Цена,
	|	ЦеныСрезПоследних.Основание,
	|	ЦеныСрезПоследних.Валюта
	|ИЗ
	|	РегистрСведений.Цены.СрезПоследних(
	|			&Дата,
	|			ТипВС = &ТипВС
	|				И ДействителенДо >= &Дата
	|				И ИностранныйВС = &ИностранныйВС
	|				И &ИностранныйВС = ИСТИНА
	|				И Услуга = &Услуга) КАК ЦеныСрезПоследних
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЦеныСрезПоследних.Цена,
	|	ЦеныСрезПоследних.Основание,
	|	ЦеныСрезПоследних.Валюта
	|ИЗ
	|	РегистрСведений.Цены.СрезПоследних(
	|			&Дата,
	|			МассаЛ <= &Масса
	|				И МассаП >= &Масса
	|				И ДействителенДо >= &Дата
	|				И ИностранныйВС = &ИностранныйВС
	|				И &ИностранныйВС = ИСТИНА
	|				И Услуга = &Услуга) КАК ЦеныСрезПоследних
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЦеныСрезПоследних.Цена,
	|	ЦеныСрезПоследних.Основание,
	|	ЦеныСрезПоследних.Валюта
	|ИЗ
	|	РегистрСведений.Цены.СрезПоследних(
	|			&Дата,
	|			ДействителенДо >= &Дата
	|				И ИностранныйВС = &ИностранныйВС
	|				И &ИностранныйВС = ИСТИНА
	|				И Услуга = &Услуга) КАК ЦеныСрезПоследних
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЦеныСрезПоследних.Цена,
	|	ЦеныСрезПоследних.Основание,
	|	ЦеныСрезПоследних.Валюта
	|ИЗ
	|	РегистрСведений.Цены.СрезПоследних(
	|			&Дата,
	|			ТипВС = &ТипВС
	|				И ДействителенДо >= &Дата
	|				И Услуга = &Услуга) КАК ЦеныСрезПоследних
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЦеныСрезПоследних.Цена,
	|	ЦеныСрезПоследних.Основание,
	|	ЦеныСрезПоследних.Валюта
	|ИЗ
	|	РегистрСведений.Цены.СрезПоследних(
	|			&Дата,
	|			МассаЛ <= &Масса
	|				И МассаП >= &Масса
	|				И ДействителенДо >= &Дата
	|				И ЭтоВертолет = ЛОЖЬ
	|				И ИностранныйВС = ЛОЖЬ
	|				И Услуга = &Услуга) КАК ЦеныСрезПоследних
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЦеныСрезПоследних.Цена,
	|	ЦеныСрезПоследних.Основание,
	|	ЦеныСрезПоследних.Валюта
	|ИЗ
	|	РегистрСведений.Цены.СрезПоследних(
	|			&Дата,
	|			ДействителенДо >= &Дата
	|				И ЭтоВертолет = ЛОЖЬ
	|				И ИностранныйВС = ЛОЖЬ
	|				И Услуга = &Услуга) КАК ЦеныСрезПоследних";

	
	Запрос1.УстановитьПараметр("ТипВС", ТипВС);
	Запрос1.УстановитьПараметр("Услуга", Услуга);
	Запрос1.УстановитьПараметр("Дата", Дата);
	Запрос1.УстановитьПараметр("Масса", Масса);
	Запрос1.УстановитьПараметр("ЭтоВертолет", ТипВС.ЭтоВертолет);

	Если  ВладелецВС.ВидКонтрагента = Перечисления.ВидыПолета.Иностранный Тогда 
		Иностранный = Истина;
	Иначе 
		Иностранный = Ложь;
	КонецЕсли;
	
	Запрос1.УстановитьПараметр("ИностранныйВС", Иностранный);
	Результат1 = Запрос1.Выполнить();
	Если Результат1.Пустой() Тогда
		Выборка.Вставить("Успех", Ложь);		
	Иначе
		Выборка.Вставить("Успех", Истина);		
		Результат1 = Запрос1.Выполнить().Выбрать();	
		Результат1.Следующий();
		Выборка.Вставить("Цена", Результат1.Цена);
		Выборка.Вставить("Основание", Результат1.Основание);
		Выборка.Вставить("Валюта", Результат1.Валюта); 
	КонецЕсли;                          	
	//проверяем есть ли скидка
	Запрос2 = Новый Запрос;
	Запрос2.Текст = 
		"ВЫБРАТЬ
		|	СкидкиСрезПоследних.Процент КАК Процент,
		|	СкидкиСрезПоследних.Основание КАК Основание
		|ИЗ
		|	РегистрСведений.Скидки.СрезПоследних(&Дата, ) КАК СкидкиСрезПоследних
		|ГДЕ
		|	СкидкиСрезПоследних.Авиакомпания = &Авиакомпания
		|	И СкидкиСрезПоследних.РейсОтправления = &РейсОтправления
		|	И СкидкиСрезПоследних.ДействителенДо >= &Дата
		|	И СкидкиСрезПоследних.ИностранныйВС = &ИностранныйВС
		|	И СкидкиСрезПоследних.Услуга = &Услуга
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СкидкиСрезПоследних.Процент,
		|	СкидкиСрезПоследних.Основание
		|ИЗ
		|	РегистрСведений.Скидки.СрезПоследних(&Дата, ) КАК СкидкиСрезПоследних
		|ГДЕ
		|	СкидкиСрезПоследних.Авиакомпания = &Авиакомпания
		|	И СкидкиСрезПоследних.ДействителенДо >= &Дата
		|	И СкидкиСрезПоследних.Услуга = &Услуга
		|	И СкидкиСрезПоследних.ИностранныйВС = &ИностранныйВС
		|	И СкидкиСрезПоследних.РейсОтправления = ЗНАЧЕНИЕ(Справочник.Рейсы.ПустаяСсылка)";
	
	Запрос2.УстановитьПараметр("Авиакомпания", Авиакомпания);
	Запрос2.УстановитьПараметр("Дата", Дата);
	Запрос2.УстановитьПараметр("ИностранныйВС", Иностранный);
	Запрос2.УстановитьПараметр("Услуга", Услуга);
	Запрос2.УстановитьПараметр("РейсОтправления", Рейс);
	Результат2 = Запрос2.Выполнить();
	Если Результат2.Пустой() Тогда
		Выборка.Вставить("Скидка", 0);		
	Иначе
		Результат2 = Запрос2.Выполнить().Выбрать();	
		Результат2.Следующий();
		Выборка.Вставить("Скидка", Результат2.Процент);
		Выборка.Основание=Выборка.Основание + " + " + Результат2.Основание;
	КонецЕсли; 
	
	Возврат Выборка;
КонецФункции

&НаСервере
Функция ПолучитьВспомогательное(ВладелецВС,Рейс)
	Выборка = Новый Структура;
	Если  ВладелецВС.ВидКонтрагента = Перечисления.ВидыПолета.Иностранный Тогда 
		Выборка.Вставить("Иностранный", Истина);
	Иначе 
		Выборка.Вставить("Иностранный", Ложь);
	КонецЕсли;
	
	Если  ВладелецВС.ВидКонтрагента = Перечисления.ВидыПолета.Ведомственный Тогда 
		Выборка.Вставить("Ведомственный", Истина);
	Иначе 
		Выборка.Вставить("Ведомственный", Ложь);
	КонецЕсли;
	Выборка.Вставить("ПроцентПродлениеРегламента", Константы.ПродлениеРегламента.Получить());
	Выборка.Вставить("Авиакомпания", Рейс.Авиакомпания);
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтавкаНДССрезПоследних.Процент КАК Процент
		|ИЗ
		|	РегистрСведений.СтавкаНДС.СрезПоследних(&Дата, ) КАК СтавкаНДССрезПоследних";
	Запрос.УстановитьПараметр("Дата", Объект.Дата);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда 
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Ошибка при получении ставки НДС";
		Сообщение.Сообщить();		
	Иначе 	
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			РезультатЗапроса = Запрос.Выполнить().Выбрать();	
			РезультатЗапроса.Следующий();
			Выборка.Вставить("ПроцентНДС",РезультатЗапроса.Процент);
		КонецЦикла;      		
	КонецЕсли;

	
	Выборка.Вставить("ВзлетПосадка", Справочники.Услуги.СборЗаВзлётПосадку);
	Возврат Выборка;
КонецФункции

&НаСервере
Функция ПолучитьИностранныйАП(Аэропорт)
	Возврат Аэропорт.Иностранный;
КонецФункции	

&НаКлиенте
Процедура ПересчетСтроки(НомерСтроки)
	тУслуга=Объект.Услуги.НайтиПоИдентификатору(НомерСтроки).Услуга;
	тЦена=Объект.Услуги.НайтиПоИдентификатору(НомерСтроки).Цена;
	тПлательщик=Объект.Плательщик;
	тВладелецВС=Объект.ВладелецВС;
	тРейс=Объект.РейсОтправления;
	тДата=Объект.Дата;
	тМасса=Объект.Масса;
	тТипВС=Объект.ТипВС;
	Количество=Объект.Услуги.НайтиПоИдентификатору(НомерСтроки).Количество;
	Скидка=Объект.Услуги.НайтиПоИдентификатору(НомерСтроки).Скидка;
	Вспомогательное=ПолучитьВспомогательное(тВладелецВС,тРейс);			
			
		Если Объект.РучноеРедактирование Тогда 
			Объект.Услуги.НайтиПоИдентификатору(НомерСтроки).Основание="Ручное редактирование";
			Объект.Услуги.НайтиПоИдентификатору(НомерСтроки).Скидка=0;
		Иначе 
			Результат=ПолучитьЦену(тУслуга,тВладелецВС,тПлательщик,тДата,тМасса,тТипВС,тРейс);
			Если не Результат.Успех Тогда
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Для данной услуги цена еще не установлена!";
				Сообщение.Поле = "Объект.Услуги["+НомерСтроки+"].Услуга";
				Сообщение.Сообщить(); 		
			Иначе
				Объект.Услуги.НайтиПоИдентификатору(НомерСтроки).Основание=Результат.Основание;
				Объект.Услуги.НайтиПоИдентификатору(НомерСтроки).Скидка=Результат.Скидка;
				Объект.Услуги.НайтиПоИдентификатору(НомерСтроки).Валюта=Результат.Валюта;
				
				Если Результат.Валюта Тогда 
					Объект.Услуги.НайтиПоИдентификатору(НомерСтроки).Цена = Результат.Цена * Объект.КурсВалюты;
					Объект.Услуги.НайтиПоИдентификатору(НомерСтроки).Основание = Объект.Услуги.НайтиПоИдентификатору(НомерСтроки).Основание + 
						" Цена в У.Е. = " + Результат.Цена;						
				Иначе
					Объект.Услуги.НайтиПоИдентификатору(НомерСтроки).Цена=Результат.Цена;
				КонецЕсли; 	
				
			КонецЕсли;
		КонецЕсли;	
					
		Если ПолучитьНДС(тУслуга) Тогда
			ПроцентНДС=Вспомогательное.ПроцентНДС;
		Иначе
			ПроцентНДС=0;
		КонецЕсли;	
		
		Если Объект.Услуги.НайтиПоИдентификатору(НомерСтроки).ПревышениеРегламента Тогда
			ПроцентПродлениеРегламента=Вспомогательное.ПроцентПродлениеРегламента;
		Иначе
			ПроцентПродлениеРегламента=0;
		КонецЕсли;
		
			
		
		Объект.Услуги.НайтиПоИдентификатору(НомерСтроки).Сумма=Окр(Объект.Услуги.НайтиПоИдентификатору(НомерСтроки).Цена*(100+ПроцентПродлениеРегламента)*(100-Объект.Услуги.НайтиПоИдентификатору(НомерСтроки).Скидка)/10000,2)*Количество;	
		Объект.Услуги.НайтиПоИдентификатору(НомерСтроки).НДС=Объект.Услуги.НайтиПоИдентификатору(НомерСтроки).Сумма*ПроцентНДС/100;	
		Объект.Услуги.НайтиПоИдентификатору(НомерСтроки).Сумма=Объект.Услуги.НайтиПоИдентификатору(НомерСтроки).Сумма+Объект.Услуги.НайтиПоИдентификатору(НомерСтроки).НДС;	
		ПересчетИтого();

КонецПроцедуры	

&НаКлиенте
Процедура ПересчетИтого()
	//суммируем сумму и ндс всех ячеек таблицы
	тИтого = 0;
	тИтогоНДС = 0;		
	Для Каждого Услуга из Объект.Услуги Цикл
		тИтого = тИтого + Услуга.Сумма;
		тИтогоНДС = тИтогоНДС + Услуга.НДС;
	КонецЦикла;
	Объект.Итого = тИтого;
	Объект.ИтогоНДС = тИтогоНДС;
КонецПроцедуры

&НаСервере
Функция ПроверкаВедомственного(Услуга)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УслугиВедомственных.Услуга КАК Услуга
		|ИЗ
		|	РегистрСведений.УслугиВедомственных КАК УслугиВедомственных
		|ГДЕ
		|	УслугиВедомственных.Услуга = &Услуга";
	
	Запрос.УстановитьПараметр("Услуга", Услуга);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда 
		Возврат Ложь;
	Иначе 
		Возврат Истина;
	КонецЕсли;	
КонецФункции	

&НаКлиенте
Процедура УслугиУслугаПриИзменении(Элемент)
	Если (не ПроверкаВедомственного(Элементы.Услуги.ТекущиеДанные.Услуга) и ПолучитьВспомогательное(Объект.Плательщик,Объект.РейсПрибытия).Ведомственный) Тогда  
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Данная услуга недоступна для ведомственных рейсов!";
		Сообщение.Поле = "Услуги["+ТекущийЭлемент.ТекущаяСтрока+"].Услуга";
		Сообщение.УстановитьДанные(Элемент);
		Сообщение.Сообщить();
		Элементы.Услуги.ТекущиеДанные.Услуга = ПерУслуга;
	Иначе	
		ПересчетСтроки(ТекущийЭлемент.ТекущаяСтрока);
	КонецЕсли;	
	ПересчетИтого();	
КонецПроцедуры

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	ПересчетСтроки(ТекущийЭлемент.ТекущаяСтрока);
	ПересчетИтого();	
КонецПроцедуры

&НаКлиенте
Процедура РейсПриИзменении(Элемент)
	Объект.ВладелецВС=ПолучитьВспомогательное(Объект.Плательщик,Объект.РейсОтправления).Авиакомпания;
	Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ПревышениеРегламентаПриИзменении(Элемент)
	ПересчетСтроки(ТекущийЭлемент.ТекущаяСтрока);
	ПересчетИтого();	
КонецПроцедуры

&НаКлиенте
Процедура РучноеРедактированиеПриИзменении(Элемент)
	Если Объект.РучноеРедактирование Тогда
		Элементы.УслугиЦена.Доступность = Истина;
	Иначе
		Элементы.УслугиЦена.Доступность = Ложь;
		Обновить();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	ПересчетСтроки(ТекущийЭлемент.ТекущаяСтрока);
	ПересчетИтого();	
КонецПроцедуры

&НаСервере
Функция ПолучитьНДС(Услуга)
	Возврат Услуга.ВключаетНДС;	
КонецФункции	

&НаКлиенте
Процедура Обновить()
	Если не Объект.РучноеРедактирование Тогда 
		СчитатьПрилет();
		СчитатьВылет();
		ПроверитьНаСверхнормативную();
		для Каждого Строка из Объект.Услуги Цикл 
			ПересчетСтроки(Строка.НомерСтроки-1);
		КонецЦикла;
		ПересчетИтого();
	КонецЕсли;	
КонецПроцедуры	

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ВладелецВСПриИзменении(Элемент)
	Обновить();
КонецПроцедуры

&НаСервере
Процедура СчитатьПрилет()
	Если Объект.Прилет = Документы.Прилеты.ПустаяСсылка() Тогда
		Возврат;
	КонецЕсли;
		
	Иностранный=ПолучитьИностранныйАП(Объект.Прилет.АэропортВылета);   //Иностранный аэропорт вылета
	ФВзрА=Ложь;
	ФДетиА=Ложь;
	ФГрузТ=Ложь;
	
	
	
	для Каждого Строка из Объект.Услуги Цикл 
		Если Иностранный Тогда
			Если Строка.Услуга = Константы.ФСПМВзрослыеА.Получить() Тогда 
				Строка.Количество=Объект.Прилет.ПассажирыВзрослые;
				ФВзрА=Истина;
			КонецЕсли;
			Если Строка.Услуга = Константы.ФСПМДетиА.Получить() Тогда 
				Строка.Количество=Объект.Прилет.ПассажирыДети;
				ФДетиА=Истина;
			КонецЕсли;	
			Если Строка.Услуга = Константы.ФСПМГрузТ.Получить() Тогда 
				Строка.Количество=Объект.Прилет.Груз+Объект.Прилет.Почта;
				ФГрузТ=Истина;
			КонецЕсли;			
			
		Иначе 	
			Если Строка.Услуга = Константы.ФСПВВзрослыеА.Получить() Тогда 
				Строка.Количество=Объект.Прилет.ПассажирыВзрослые;
				ФВзрА=Истина;
			КонецЕсли;
			Если Строка.Услуга = Константы.ФСПВДетиА.Получить() Тогда 
				Строка.Количество=Объект.Прилет.ПассажирыДети;
				ФДетиА=Истина;
			КонецЕсли;
			Если Строка.Услуга = Константы.ФСПВГрузТ.Получить() Тогда 
				Строка.Количество=Объект.Прилет.Груз+Объект.Прилет.Почта;
				ФГрузТ=Истина;
			КонецЕсли;
		КонецЕсли;		
	КонецЦикла;
	
	
	
	Если Иностранный Тогда 
		Если (не ФВзрА) и (Объект.Прилет.ПассажирыВзрослые>0) Тогда
			НоваяСтрока=Объект.Услуги.Добавить();
			НоваяСтрока.Услуга=Константы.ФСПМВзрослыеА.Получить();
			НоваяСтрока.Количество=Объект.Прилет.ПассажирыВзрослые;
		КонецЕсли;
		Если (не ФДетиА) и (Объект.Прилет.ПассажирыДети>0) Тогда
			НоваяСтрока=Объект.Услуги.Добавить();
			НоваяСтрока.Услуга=Константы.ФСПМДетиА.Получить();
			НоваяСтрока.Количество=Объект.Прилет.ПассажирыДети;
		КонецЕсли;		
		Если (не ФГрузТ) и (Объект.Прилет.Груз+Объект.Прилет.Почта>0) Тогда
			НоваяСтрока=Объект.Услуги.Добавить();
			НоваяСтрока.Услуга=Константы.ФСПМГрузТ.Получить();
			НоваяСтрока.Количество=Объект.Прилет.Груз+Объект.Прилет.Почта;
		КонецЕсли;
		
		
	Иначе 	
		Если (не ФВзрА) и (Объект.Прилет.ПассажирыВзрослые>0) Тогда
			НоваяСтрока=Объект.Услуги.Добавить();
			НоваяСтрока.Услуга=Константы.ФСПВВзрослыеА.Получить();
			НоваяСтрока.Количество=Объект.Прилет.ПассажирыВзрослые;
		КонецЕсли;
		Если (не ФДетиА) и (Объект.Прилет.ПассажирыДети>0) Тогда
			НоваяСтрока=Объект.Услуги.Добавить();
			НоваяСтрока.Услуга=Константы.ФСПВДетиА.Получить();
			НоваяСтрока.Количество=Объект.Прилет.ПассажирыДети;
		КонецЕсли;
		Если (не ФГрузТ) и (Объект.Прилет.Груз+Объект.Прилет.Почта>0) Тогда
			НоваяСтрока=Объект.Услуги.Добавить();
			НоваяСтрока.Услуга=Константы.ФСПВГрузТ.Получить();
			НоваяСтрока.Количество=Объект.Прилет.Груз+Объект.Прилет.Почта;
		КонецЕсли;
	КонецЕсли;
	
	Объект.ДатаИВремяПосадки=Объект.Прилет.ПрибытиеФакт;
	Объект.НомерБорта=Объект.Прилет.НомерБорта;
	Объект.РейсПрибытия=Объект.Прилет.Рейс;
КонецПроцедуры

&НаСервере
Процедура СчитатьВылет()
	Если Объект.Вылет = Документы.Вылеты.ПустаяСсылка() Тогда
		Возврат;
	КонецЕсли;
	
	Иностранный=ПолучитьИностранныйАП(Объект.Вылет.АэропортПрилета);
	ФВзрА=Ложь;
	ФВзрТ=Ложь;
	ФВзрV=Ложь;
	ФДетиА=Ложь;
	ФДетиТ=Ложь;
	ФДетиV=Ложь;
	ФГрузТ=Ложь;
	ФАрк1=Ложь;
	ФАрк4=Ложь;
	для Каждого Строка из Объект.Услуги Цикл 
		Если Строка.Услуга = Константы.ФСВАрк1.Получить() Тогда 
				Строка.Количество=Объект.Вылет.АрктикаТ1;
				ФАрк1=Истина;
		КонецЕсли;
		Если Строка.Услуга = Константы.ФСВАрк4.Получить() Тогда 
				Строка.Количество=Объект.Вылет.АрктикаТ4;
				ФАрк4=Истина;
		КонецЕсли;
			
			
		
		Если Иностранный Тогда
			Если Строка.Услуга = Константы.ФСВМВзрослыеА.Получить() Тогда 
				Строка.Количество=Объект.Вылет.ПассажирыВзрослые;
				ФВзрА=Истина;
			КонецЕсли;
			Если Строка.Услуга = Константы.ФСВМВзрослыеТ.Получить() Тогда 
				Строка.Количество=Объект.Вылет.ПассажирыВзрослые-Объект.Вылет.VIPПассажирыВзрослые;
				ФВзрТ=Истина;
			КонецЕсли;
			Если Строка.Услуга = Константы.ФСВМДетиА.Получить() Тогда 
				Строка.Количество=Объект.Вылет.ПассажирыДети;
				ФДетиА=Истина;
			КонецЕсли;	
			Если Строка.Услуга = Константы.ФСВМДетиТ.Получить() Тогда 
				Строка.Количество=Объект.Вылет.ПассажирыДети-Объект.Вылет.VIPПассажирыДети;
				ФДетиТ=Истина;
			КонецЕсли;
			Если Строка.Услуга = Константы.ФСВМГрузТ.Получить() Тогда 
				Строка.Количество=Объект.Вылет.Груз+Объект.Вылет.Почта;
				ФГрузТ=Истина;
			КонецЕсли;
			Если Строка.Услуга = Константы.ФСВVВзрослыеТ.Получить() Тогда 
				Строка.Количество=Объект.Вылет.VIPПассажирыВзрослые;
				ФВзрV=Истина;
			КонецЕсли;
			Если Строка.Услуга = Константы.ФСВVДетиТ.Получить() Тогда 
				Строка.Количество=Объект.Вылет.VIPПассажирыДети;
				ФДетиV=Истина;
			КонецЕсли;
			
			
		Иначе
			Если Строка.Услуга = Константы.ФСВВВзрослыеА.Получить() Тогда 
				Строка.Количество=Объект.Вылет.ПассажирыВзрослые;
				ФВзрА=Истина;
			КонецЕсли;
			Если Строка.Услуга = Константы.ФСВВВзрослыеТ.Получить() Тогда 
				Строка.Количество=Объект.Вылет.ПассажирыВзрослые-Объект.Вылет.VIPПассажирыВзрослые;
				ФВзрТ=Истина;
			КонецЕсли;
			Если Строка.Услуга = Константы.ФСВВДетиА.Получить() Тогда 
				Строка.Количество=Объект.Вылет.ПассажирыДети;
				ФДетиА=Истина;
			КонецЕсли;
			Если Строка.Услуга = Константы.ФСВВДетиТ.Получить() Тогда 
				Строка.Количество=Объект.Вылет.ПассажирыДети-Объект.Вылет.VIPПассажирыДети;
				ФДетиТ=Истина;
			КонецЕсли;
			Если Строка.Услуга = Константы.ФСВВГрузТ.Получить() Тогда 
				Строка.Количество=Объект.Вылет.Груз+Объект.Вылет.Почта;
				ФГрузТ=Истина;
			КонецЕсли;
			Если Строка.Услуга = Константы.ФСВVВзрослыеТ.Получить() Тогда 
				Строка.Количество=Объект.Вылет.VIPПассажирыВзрослые;
				ФВзрV=Истина;
			КонецЕсли;
			Если Строка.Услуга = Константы.ФСВVДетиТ.Получить() Тогда 
				Строка.Количество=Объект.Вылет.VIPПассажирыДети;
				ФДетиV=Истина;
			КонецЕсли;
		КонецЕсли;		
	КонецЦикла;
	
	
	
	Если (не ФАрк1) и (Объект.Вылет.АрктикаТ1>0)Тогда
			НоваяСтрока=Объект.Услуги.Добавить();
			НоваяСтрока.Услуга=Константы.ФСВАрк1.Получить();
			НоваяСтрока.Количество=Объект.Вылет.АрктикаТ1;
	КонецЕсли;
	Если (не ФАрк4) и (Объект.Вылет.АрктикаТ4>0) Тогда
			НоваяСтрока=Объект.Услуги.Добавить();
			НоваяСтрока.Услуга=Константы.ФСВАрк4.Получить();
			НоваяСтрока.Количество=Объект.Вылет.АрктикаТ4;
	КонецЕсли;
	
	
	Если Иностранный Тогда 
		Если (не ФВзрА) и (Объект.Вылет.ПассажирыВзрослые>0) Тогда
			НоваяСтрока=Объект.Услуги.Добавить();
			НоваяСтрока.Услуга=Константы.ФСВМВзрослыеА.Получить();
			НоваяСтрока.Количество=Объект.Вылет.ПассажирыВзрослые;
		КонецЕсли;
		Если (не ФВзрТ) и (Объект.Вылет.ПассажирыВзрослые-Объект.Вылет.VIPПассажирыВзрослые>0) Тогда
			НоваяСтрока=Объект.Услуги.Добавить();
			НоваяСтрока.Услуга=Константы.ФСВМВзрослыеТ.Получить();
			НоваяСтрока.Количество=Объект.Вылет.ПассажирыВзрослые-Объект.Вылет.VIPПассажирыВзрослые;
		КонецЕсли;
		Если (не ФДетиА) и (Объект.Вылет.ПассажирыДети>0) Тогда
			НоваяСтрока=Объект.Услуги.Добавить();
			НоваяСтрока.Услуга=Константы.ФСВМДетиА.Получить();
			НоваяСтрока.Количество=Объект.Вылет.ПассажирыДети;
		КонецЕсли;		
		Если (не ФДетиТ) и (Объект.Вылет.ПассажирыДети>0) Тогда
			НоваяСтрока=Объект.Услуги.Добавить();
			НоваяСтрока.Услуга=Константы.ФСВМДетиТ.Получить();
			НоваяСтрока.Количество=Объект.Вылет.ПассажирыДети-Объект.Вылет.VIPПассажирыДети;
		КонецЕсли;
		Если (не ФГрузТ) и (Объект.Вылет.Груз+Объект.Вылет.Почта>0) Тогда
			НоваяСтрока=Объект.Услуги.Добавить();
			НоваяСтрока.Услуга=Константы.ФСВМГрузТ.Получить();
			НоваяСтрока.Количество=Объект.Вылет.Груз+Объект.Вылет.Почта;
		КонецЕсли;
		Если (не ФВзрV) и (Объект.Вылет.VIPПассажирыВзрослые>0) Тогда
			НоваяСтрока=Объект.Услуги.Добавить();
			НоваяСтрока.Услуга=Константы.ФСВVВзрослыеТ.Получить();
			НоваяСтрока.Количество=Объект.Вылет.VIPПассажирыВзрослые;
		КонецЕсли;
		Если (не ФДетиV) и (Объект.Вылет.VIPПассажирыДети>0) Тогда
			НоваяСтрока=Объект.Услуги.Добавить();
			НоваяСтрока.Услуга=Константы.ФСВVДетиТ.Получить();
			НоваяСтрока.Количество=Объект.Вылет.VIPПассажирыДети;
		КонецЕсли;
	Иначе 	
		Если (не ФВзрА) и (Объект.Вылет.ПассажирыВзрослые>0) Тогда
			НоваяСтрока=Объект.Услуги.Добавить();
			НоваяСтрока.Услуга=Константы.ФСВВВзрослыеА.Получить();
			НоваяСтрока.Количество=Объект.Вылет.ПассажирыВзрослые;
		КонецЕсли;
		Если (не ФВзрТ) и (Объект.Вылет.ПассажирыВзрослые-Объект.Вылет.VIPПассажирыВзрослые>0) Тогда
			НоваяСтрока=Объект.Услуги.Добавить();
			НоваяСтрока.Услуга=Константы.ФСВВВзрослыеТ.Получить();
			НоваяСтрока.Количество=Объект.Вылет.ПассажирыВзрослые-Объект.Вылет.VIPПассажирыВзрослые;
		КонецЕсли;
		Если (не ФДетиА) и (Объект.Вылет.ПассажирыДети>0) Тогда
			НоваяСтрока=Объект.Услуги.Добавить();
			НоваяСтрока.Услуга=Константы.ФСВВДетиА.Получить();
			НоваяСтрока.Количество=Объект.Вылет.ПассажирыДети;
		КонецЕсли;
		Если (не ФДетиТ) и (Объект.Вылет.ПассажирыДети>0) Тогда
			НоваяСтрока=Объект.Услуги.Добавить();
			НоваяСтрока.Услуга=Константы.ФСВВДетиТ.Получить();
			НоваяСтрока.Количество=Объект.Вылет.ПассажирыДети-Объект.Вылет.VIPПассажирыДети;
		КонецЕсли;
		Если (не ФГрузТ) и (Объект.Вылет.Груз+Объект.Вылет.Почта>0) Тогда
			НоваяСтрока=Объект.Услуги.Добавить();
			НоваяСтрока.Услуга=Константы.ФСВВГрузТ.Получить();
			НоваяСтрока.Количество=Объект.Вылет.Груз+Объект.Вылет.Почта;
		КонецЕсли;
		Если (не ФВзрV) и (Объект.Вылет.VIPПассажирыВзрослые>0) Тогда
			НоваяСтрока=Объект.Услуги.Добавить();
			НоваяСтрока.Услуга=Константы.ФСВVВзрослыеТ.Получить();
			НоваяСтрока.Количество=Объект.Вылет.VIPПассажирыВзрослые;
		КонецЕсли;
		Если (не ФДетиV) и (Объект.Вылет.VIPПассажирыДети>0) Тогда
			НоваяСтрока=Объект.Услуги.Добавить();
			НоваяСтрока.Услуга=Константы.ФСВVДетиТ.Получить();
			НоваяСтрока.Количество=Объект.Вылет.VIPПассажирыДети;
		КонецЕсли;
	КонецЕсли;
	
	Объект.ДатаИВремяВылета=Объект.Вылет.ВремяВзлета;
	Объект.РейсОтправления=Объект.Вылет.Рейс;
КонецПроцедуры

&НаКлиенте
Процедура ПрилетПриИзменении(Элемент)
	Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ВылетПриИзменении(Элемент)
	Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ТипВСПриИзменении(Элемент)
	Обновить();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Ответственные.Параметры.УстановитьЗначениеПараметра("Регистратор",Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура УслугиПередНачаломИзменения(Элемент, Отказ)
	ПерУслуга = Элементы.Услуги.ТекущиеДанные.Услуга;
КонецПроцедуры

&НаКлиенте
Процедура УслугиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	ПерУслуга = "";
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	Если Объект.Плательщик.ВидКонтрагента = Перечисления.ВидыПолета.Ведомственный Тогда 
		Стр = 0;
		Для Каждого Услуга из Объект.Услуги Цикл
			Если не ПроверкаВедомственного(Услуга.Услуга) Тогда  
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Услуга "+Услуга.Услуга+" недоступна для ведомственных рейсов!";
				Сообщение.Сообщить();
				Отказ = Истина;
			КонецЕсли;
			Стр = Стр + 1;
		КонецЦикла;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура МассаПриИзменении(Элемент)
	Обновить();
КонецПроцедуры

&НаКлиенте
Процедура УслугиПослеУдаления(Элемент)
	ПересчетИтого();
КонецПроцедуры

&НаКлиенте
Процедура КурсВалютыПриИзменении(Элемент)
	Обновить();
КонецПроцедуры

&НаСервере
Процедура ПроверитьНаСверхнормативную()
	
	ФСверх = Ложь;
	
	Если Объект.ВладелецВС.ВидКонтрагента = Перечисления.ВидыПолета.Иностранный Тогда 
		
		Если (Объект.Масса > 0) И (Объект.ДатаИВремяВылета - Объект.ДатаИВремяПосадки - 10800 > 0) Тогда
			Количество = Цел((Объект.ДатаИВремяВылета - Объект.ДатаИВремяПосадки - 10800)/86400) + 1;
		   	
			для Каждого Строка из Объект.Услуги Цикл
				Если Строка.Услуга = Справочники.Услуги.СборЗаСверхнормативнуюСтоянкуИ Тогда 
					Строка.Количество = Количество * Объект.Масса;
					ФСверх = Истина;					
				КонецЕсли;	
			КонецЦикла;
			
			Если не ФСверх Тогда 
				НоваяСтрока=Объект.Услуги.Добавить();
				НоваяСтрока.Услуга=Справочники.Услуги.СборЗаСверхнормативнуюСтоянкуИ;
				НоваяСтрока.Количество=Количество * Объект.Масса;		
			КонецЕсли;	
		КонецЕсли;
	Иначе
		
		Если (Объект.Масса > 0) И (Объект.ДатаИВремяВылета - Объект.ДатаИВремяПосадки - 10800 > 0) Тогда
			Количество = Окр((Объект.ДатаИВремяВылета - Объект.ДатаИВремяПосадки - 10800)/3600);
			
			Если Количество > 0 Тогда
				
				для Каждого Строка из Объект.Услуги Цикл
			    	Если Строка.Услуга = Справочники.Услуги.СборЗаСверхнормативнуюСтоянкуР Тогда 
						Строка.Количество = Количество * Объект.Масса;
						ФСверх = Истина;					
					КонецЕсли;	
					
				КонецЦикла;				
				
			КонецЕсли;			
			
		КонецЕсли;	
		
	КонецЕсли;	
	
КонецПроцедуры
